import 'package:kozarni_ecome/model/division.dart';

final List<Division> divisionList = [
  //Yangon Division
  Division(
    name: "ရန်ကုန်တိုင်း",
    townShipMap: {
      '1400': [
        "ကျောက်တံတား   ၁၄၀၀",
        "လမ်းမတော်   ၁၄၀၀",
        "လသာ   ၁၄၀၀",
        "ပန်းဘဲတန်း   ၁၄၀၀",
        "ဗိုလ်တထောင်   ၁၄၀၀",
        "မင်္ဂလာတောင်ညွန့်   ၁၄၀၀",
        "ပုဇွန်တောင်   ၁၄၀၀",
      ],
      '1900': [
        "အလုံ   ၁၉၀၀",
        "ဗဟန်း   ၁၉၀၀",
        "ဒဂုံ   ၁၉၀၀",
        "လှိုင်   ၁၉၀၀",
        "ကမာရွတ်   ၁၉၀၀",
        "ကြည့်မြင်တိုင်   ၁၉၀၀",
        "မရမ်းကုန်း   ၁၉၀၀",
        "စမ်းချောင်း   ၁၉၀၀",
        "ဒဂုံဆိပ်ကမ်း   ၁၉၀၀",
        "ဒေါပုံ   ၁၉၀၀",
        "အရှေ့ဒဂုံ   ၁၉၀၀",
        "မြောက်ဒဂုံ   ၁၉၀၀",
        "တောင်ဒဂုံ   ၁၉၀၀",
        "မြောက်ဥကလာ   ၁၉၀၀",
        "တောင်ဥပလာ   ၁၉၀၀",
        "တာမွေ   ၁၉၀၀",
        "သာကေတ   ၁၉၀၀",
        "သင်္ယန်းကျွန်း   ၁၉၀၀",
        "ရန်ကင်း   ၁၉၀၀",
        "လှိုင်သာယာ   ၁၉၀၀",
        "အင်းစိန်   ၁၉၀၀",
        "မင်္ဂလာဒုံ   ၁၉၀၀",
        "ရွှေပြည်သာ   ၁၉၀၀",
        "သံလျှင်   ၁၉၀၀",
      ],
      '2500': [
        "လှည်းကူး   ၂၅၀၀",
        "မှော်ဘီ/တိုက်ကြီး   ၂၅၀၀",
        "ထန်းတပင်   ၂၅၀၀",
        "ဒလ/ကော့မူး   ၂၅၀၀",
        "ကွမ်းခြံကုန်း   ၂၅၀၀",
        "ခရမ်း/သုံးခွ   ၂၅၀၀",
        "တွံတေး   ၂၅၀၀",
      ]
    },
  ),
  //Mandalay Division
  Division(
    name: "မန္တလေးတိုင်း",
    townShipMap: {
      "3500": [
        "တောင်သာ   ၃၅၀၀",
      ],
      "2500": [
        "အမရပူရ   ၂၅၀၀",
        "အောင်မြေသာဇံ   ၂၅၀၀",
        "ချမ်းအေးသာဇံ   ၂၅၀၀",
        "မဟာအောင်မြေ   ၂၅၀၀",
        "ပုသိမ်ကြီး   ၂၅၀၀",
        "ပြည်ကြီးတံခွန်   ၂၅၀၀",
        "ကျောက်ဆည်   ၂၅၀၀",
        "မြစ်သား   ၂၅၀၀",
        "စဉ့်ကိုင်   ၂၅၀၀",
        "တံတားဦး   ၂၅၀၀",
        "မလှိုင်   ၂၅၀၀",
        "မိထီလာ   ၂၅၀၀",
        "မြင်းခြံ   ၂၅၀၀",
        "ညောင်ဦး   ၂၅၀၀",
        "ငါ့သရောက်   ၂၅၀၀",
        "ပြင်ဦးလွင်   ၂၅၀၀",
        "ပျော်ဘွယ်   ၂၅၀၀",
        "ရမည်းသင်း   ၂၅၀၀",
      ]
    },
  ),
  //Ayarwadi Division
  Division(
    name: "ဧရာဝတီတိုင်း",
    townShipMap: {
      "2900": [
        "မြောင်းမြ/ပုသိမ်   ၂၉၀၀",
        "ကန်ကြီးထောင့်   ၂၉၀၀",
      ]
    },
  ),
  //ပဲခူးတိုင်း
  Division(
    name: "ပဲခူးတိုင်း", 
    townShipMap: {
      "2900": [
        "ပဲခူး/တောင်ငူ   ၂၉၀၀",
        "ပေါင်းတည်   ၂၉၀၀",
        "ပြည်/ရွှေတောင်   ၂၉၀၀",
        "ကြို့ပင်ကောက်   ၂၉၀၀",
        "လက်ပတန်း   ၂၉၀၀",
        "မင်းလှ   ၂၉၀၀",
        "မိုးညို   ၂၉၀၀",
       "အုပ်ဖို   ၂၉၀၀",
      "နတ်သလင်း   ၂၉၀၀",
      "ရေတာရှည်   ၂၉၀၀",
      "စွာ   ၂၉၀၀",
  ]
    },
    ),
  //နေပြည်တော်
  Division(
    name: "နေပြည်တော်", 
    townShipMap: {
      "2500":[
        "ဥတ္တရသီရိ   ၂၅၀၀",
        "ဒက္ခိဏသီရိ   ၂၅၀၀",
        "ပုပ္ပသီရိ   ၂၅၀၀",
        "ဇေယာသီရိ   ၂၅၀၀",
        "ပျဉ်းမနား   ၂၅၀၀",
      ],
    "2900": [
      "လယ်ဝေး   ၂၉၀၀",
      "တပ်ကုန်း   ၂၉၀၀",
    ]  
    },
  ),

  Division(
    name: "ရှမ်းပြည်နယ်",
    townShipMap: {
      "2900":[
        "သီပေါ/ကျောက်မဲ   ၂၉၀၀",
        "ကလော/ညောင်ရွှေ   ၂၉၀၀",
        "အောင်ပန်း/ဟဲဟိုး   ၂၉၀၀",
      ],
      "3000": [
        "လားရှိုး/ပင်းတယ   ၃၀၀၀",
      ],

      "3200": [
        "ဟိုးပုန်း   ၃၂၀၀",
      ],

      "3500": [
        "ရက်စောက်   ၃၅၀၀",
        "နောင်ချို/ပင်ဖြစ်   ၃၅၀၀",
      ],

      "4500": [
        "မူဆည်   ၄၅၀၀",
      ],

      "4800": [
        "တာချီလိတ်   ၄၈၀၀",
        "ကျိုင်းတုံ   ၄၈၀၀",
      ],

      "5200": [
        "တန့်ယန်း   ၅၂၀၀",
      ],

    },
  ),

  Division(
    name: "စစ်ကိုင်းတိုင်း",
    townShipMap: {
      "2900":[
        "ချောင်းဦး   ၂၉၀၀",
        "မုံရွာ   ၂၉၀၀",
      ],
      "3000": [
        "စစ်ကိုင်း   ၃၀၀၀",
      ],

      "3200": [
        "အရာတော်   ၃၂၀၀",
        "ရွှေဘို   ၃၂၀၀",
      ],

      "4500": [
        "ကလေး   ၄၅၀၀",
        "ကလေးဝ   ၄၅၀၀",
      ],

      "4800": [
        "တမူး   ၄၈၀၀",
      ],
    },
  ),

  Division(
    name: "ရခိုင်ပြည်နယ်",
    townShipMap: {
      "4200":[
        "စစ်တွေ   ၄၂၀၀",
      ],
      "4500": [
        "ပုဏားကျွန်း   ၄၅၀၀",
      ],
    },
  ),

  Division(
    name: "မွန်ပြည်နယ်",
    townShipMap: {
      "2900":[
        "ချောင်းဆုံ   ၂၉၀၀",
        "မော်လမြိုင်   ၂၉၀၀",
        "ဘီးလင်း   ၂၉၀၀",
        "သထုံ   ၂၉၀၀",
      ],
      "3000": [
        "မုဒုံ   ၃၀၀၀",
        "သံဖြူဇရပ်   ၃၀၀၀",
      ],
    },
  ),

  Division(
    name: "မကွေးတိုင်း",
    townShipMap: {
      "2900":[
        "ချောက်   ၂၉၀၀",
        "မကွေး   ၂၉၀၀",
        "ပခုကူ   ၂၉၀၀",
        "ရေစကြို   ၂၉၀၀",
        "အောင်လံ   ၂၉၀၀",
      ],

    },
  ),

  Division(
    name: "ကရင်ပြည်နယ်",
    townShipMap: {
      "3500":[
        "ဘားအံ   ၃၅၀၀",
      ],

    },
  ),

  Division(
    name: "ကယားပြည်နယ်",
    townShipMap: {
      "4300":[
        "လှိုင်ကော်   ၄၃၀၀",
      ],

    },
  ),

  Division(
    name: "ကချင်ပြည်နယ်",
    townShipMap: {
      "4300":[
        "မြစ်ကြီးနား   ၄၃၀၀",
      ],

      "4500":[
        "မိုးကောင်း/မိုးညှင်း   ၄၅၀၀",
      ],

    },
  ),

];
